# Intro to Python - Part 1

Materi:
- cara mencetak menggunakan print
- variabel
- tipe data

## Print

In [4]:
print('hello')
print("hello")
print('''hello''')

hello
hello
hello

In [16]:
print('hello,\nnama saya sardi irfansyah')

hello,
nama saya sardi irfansyah

In [19]:
print('hello,nama saya sardi irfansyah,\
tinggal saya di jakarta utara dadaddkkkkkkkkkkkkkkkkkkkkkkkkk')

hello,nama saya sardi irfansyah,tinggal saya di jakarta utara dadaddkkkkkkkkkkkkkkkkkkkkkkkkk

In [18]:
print('hello,\
nama saya sardi irfansyah,\
tinggal saya di jakarta utara')

hello,nama saya sardi irfansyah,tinggal saya di jakarta utara

In [14]:
print('hello,\n\
nama saya sardi irfansyah')

hello,
nama saya sardi irfansyah

In [15]:
print("hello,\n\
nama saya sardi irfansyah")

hello,
nama saya sardi irfansyah

In [9]:
print('''hello,
nama saya sardi irfansyah''')

hello,
nama saya sardi irfansyah

## Variabel

In [21]:
a= 10
b= 20
print(a)
print(type(a))

10
<class 'int'>

In [25]:
panjang=10
lebar= 5

In [26]:
NamaKaryawan= 'Tono'
namaKaryawan= 'Joni'
nama_karyawan= 'sandi'

## Tipe Data

In [32]:
#menggunakan tipe data integer
a= 10
b= 10
print(type(a))
print(type(b))
print('integer:', a)
print('float', float(a))

<class 'int'>
<class 'int'>
integer: 10
float 10.0

In [34]:
#menggunakan tipe data float
a= 10.9
b= 10.2
print(type(a))
print(type(b))
print('integer:', int(a))
print('float', a)

<class 'float'>
<class 'float'>
integer: 10
float 10.9

In [36]:
# string
nama= 'sardi irfansyah'
kelas= '10'
print(type(kelas))
print(nama.upper())
print(nama.lower())
print(nama.split())

<class 'str'>
SARDI IRFANSYAH
sardi irfansyah
['sardi', 'irfansyah']

In [54]:
# format string 
umur= 10
nama= 'irfan'
tinggi= 100.578
print(f'umur saya adalah {umur}')
print('umur saya adalah {}'.format(umur))

print(f'nama saya adalah {nama},umur saya adalah {umur}')
print('nama saya adalah {1}, umur saya adalah {0}'.format(umur, nama))


print(f'nama saya adalah {nama},umur saya adalah {umur}, tingginya adalah {tinggi:.2f}')
print(f'nama saya adalah {nama},umur saya adalah {umur}, tingginya adalah {round(tinggi)}')

umur saya adalah 10
umur saya adalah 10
nama saya adalah irfan,umur saya adalah 10
nama saya adalah irfan, umur saya adalah 10
nama saya adalah irfan,umur saya adalah 10, tingginya adalah 100.58
nama saya adalah irfan,umur saya adalah 10, tingginya adalah 101

## Operator

In [60]:
a= 10
b= 4
print(a+b)
print(a-b)
print(a//b) # integer
print(a/b) #float
print(a%b) #modulus
print(a*b)
print(a**b)

14
6
2
2.5
2
40
10000

In [61]:
#assigment operators
x= 3
x= x + 2
print(x)

5

In [64]:
x= 3
x += 2
print(x)

5

In [67]:
# operator perbandingan
x= 3
y= 10
print(x == y) #sama dengan
print(x != y) #tidak sama dengan
print(x >= y)
print(x > y)
print(x <= y)
print(x < y)

False
True
False
False
True
True

In [73]:
#operator logika
x= 4
y= 10
print('='*5,'contoh and', '='*5)
print(x>3 and x<5)
print(x<3 and x<5)

# contoh penggunaan `or`
print('='*5,'contoh or', '='*5)
print(x>3 or x<5)
print(x<3 or x<5)
print(x<3 or x>5)

print('='*5,'contoh not', '='*5)
print(not(x>3))
print(not(x>3 or x<5))

===== contoh and =====
True
False
===== contoh or =====
True
True
False
===== contoh not =====
False
False

- Operator (`and`) akan menghasilkan output False jika salah satunya ada yang False.
- Operator (`or`) akan menghasilkan output True jika salah satunya ada yang True.

## List

In [92]:
list_kendaraan= ['mobil','motor','becak','sepeda','bajai']
print(list_kendaraan)
print(list_kendaraan[0])
print(list_kendaraan[1])
print(list_kendaraan[0:3]) #start, stop
print(list_kendaraan[0::2]) #start, stop, step
print(list_kendaraan[-1])
print(list_kendaraan[:])
print(list_kendaraan[:-2])
print(list_kendaraan[-2:])
print(list_kendaraan[-5:])

['mobil', 'motor', 'becak', 'sepeda', 'bajai']
mobil
motor
['mobil', 'motor', 'becak']
['mobil', 'becak', 'bajai']
bajai
['mobil', 'motor', 'becak', 'sepeda', 'bajai']
['mobil', 'motor', 'becak']
['sepeda', 'bajai']
['mobil', 'motor', 'becak', 'sepeda', 'bajai']

In [93]:
print(list_kendaraan[::-1])

['bajai', 'sepeda', 'becak', 'motor', 'mobil']

### ubah

In [94]:
# mengubah elemen dalam list
list_kendaraan= ['mobil','motor','becak','sepeda','bajai']
list_kendaraan[1]= 'mobil'
print(list_kendaraan)

['mobil', 'mobil', 'becak', 'sepeda', 'bajai']

In [95]:
# mengubah elemen dalam list
list_kendaraan= ['mobil','motor','becak','sepeda','bajai']
list_kendaraan[1:3]= 'mobil'
print(list_kendaraan)

['mobil', 'm', 'o', 'b', 'i', 'l', 'sepeda', 'bajai']

In [96]:
# mengubah elemen dalam list
list_kendaraan= ['mobil','motor','becak','sepeda','bajai']
list_kendaraan[1:3]= ['mobil']
print(list_kendaraan)

['mobil', 'mobil', 'sepeda', 'bajai']

In [97]:
# mengubah elemen dalam list
list_kendaraan= ['mobil','motor','becak','sepeda','bajai']
list_kendaraan[1:3]= ['mobil','mobil']
print(list_kendaraan)

['mobil', 'mobil', 'mobil', 'sepeda', 'bajai']

### menambahkan

In [98]:
# menambahkan elemen dalam list
list_kendaraan= ['mobil','motor','becak','sepeda','bajai']
list_kendaraan.insert(2,'mobil')
print(list_kendaraan)

['mobil', 'motor', 'mobil', 'becak', 'sepeda', 'bajai']

In [99]:
# menambahkan elemen dalam list
list_kendaraan= ['mobil','motor','becak','sepeda','bajai']
list_kendaraan.append('mobil')
print(list_kendaraan)

['mobil', 'motor', 'becak', 'sepeda', 'bajai', 'mobil']

In [101]:
# menambahkan elemen dalam list
list_kendaraan_1= ['mobil','motor','becak','sepeda','bajai']
list_kendaraan_2= ['mobil','motor','becak','sepeda','bajai']
list_kendaraan_1.append(list_kendaraan_2)
print(list_kendaraan_1)

['mobil', 'motor', 'becak', 'sepeda', 'bajai', ['mobil', 'motor', 'becak', 'sepeda', 'bajai']]

In [102]:
# menambahkan elemen dalam list
list_kendaraan_1= ['mobil','motor','becak','sepeda','bajai']
list_kendaraan_2= ['mobil','motor','becak','sepeda','bajai']
list_kendaraan_1.extend(list_kendaraan_2)
print(list_kendaraan_1)

['mobil', 'motor', 'becak', 'sepeda', 'bajai', 'mobil', 'motor', 'becak', 'sepeda', 'bajai']

In [103]:
# menambahkan elemen dalam list
list_kendaraan_1= ['mobil','motor','becak','sepeda','bajai']
list_kendaraan_2= ['mobil','motor','becak','sepeda','bajai']
new_list=  list_kendaraan_1 + list_kendaraan_2
print(new_list)

['mobil', 'motor', 'becak', 'sepeda', 'bajai', 'mobil', 'motor', 'becak', 'sepeda', 'bajai']

### menghapus

In [104]:
# hapus elemen dalam list
list_kendaraan= ['mobil','motor','becak','sepeda','bajai']
list_kendaraan.remove('mobil')
print(list_kendaraan)

['motor', 'becak', 'sepeda', 'bajai']

In [105]:
# hapus elemen dalam list
list_kendaraan= ['mobil','motor','becak','sepeda','bajai']
list_kendaraan.pop(1)
print(list_kendaraan)

['mobil', 'becak', 'sepeda', 'bajai']

In [106]:
# hapus elemen dalam list
list_kendaraan= ['mobil','motor','becak','sepeda','bajai']
del list_kendaraan[1:3]
print(list_kendaraan)

['mobil', 'sepeda', 'bajai']

In [107]:
# hapus elemen dalam list
list_kendaraan= ['mobil','motor','becak','sepeda','bajai']
del list_kendaraan[1:2]
print(list_kendaraan)

['mobil', 'becak', 'sepeda', 'bajai']

In [108]:
# hapus elemen dalam list
list_kendaraan= ['mobil','motor','becak','sepeda','bajai']
del list_kendaraan
print(list_kendaraan)

NameError: name 'list_kendaraan' is not defined

In [109]:
# hapus elemen dalam list
list_kendaraan= ['mobil','motor','becak','sepeda','bajai']
list_kendaraan.clear()
print(list_kendaraan)

[]

## Tuple

In [113]:
tuple_kendaraan= ('mobil','mobil','motor','becak','sepeda','bajai')
print(tuple_kendaraan)
print(tuple_kendaraan[0])
print(tuple_kendaraan[1])
print(tuple_kendaraan[0:3]) #start, stop
print(tuple_kendaraan[0::2]) #start, stop, step

('mobil', 'mobil', 'motor', 'becak', 'sepeda', 'bajai')
mobil
mobil
('mobil', 'mobil', 'motor')
('mobil', 'motor', 'sepeda')

In [117]:
tuple_kendaraan= ('mobil','motor','motor','becak','sepeda','bajai')
temp= list(tuple_kendaraan)
temp[1]= 'mobil'
print(temp)
tuple_kendaraan= tuple(temp)
print(tuple_kendaraan)

['mobil', 'mobil', 'motor', 'becak', 'sepeda', 'bajai']
('mobil', 'mobil', 'motor', 'becak', 'sepeda', 'bajai')

In [119]:
#menambahkan data ke tuple
tuple_kendaraan= ('mobil','motor','motor','becak','sepeda','bajai')
tuple_kendaraan_2= ('kapal',)
tuple_kendaraan += tuple_kendaraan_2
print(tuple_kendaraan)

('mobil', 'motor', 'motor', 'becak', 'sepeda', 'bajai', 'kapal')

In [126]:
# hapus elemen dalam list
tuple_kendaraan= ('mobil','motor','motor','becak','sepeda','bajai')
del tuple_kendaraan
print(tuple_kendaraan)

NameError: name 'tuple_kendaraan' is not defined

In [130]:
# unpacking tuple
tuple_kendaraan= ('mobil','motor','motor','becak','sepeda','bajai')
(kendaraan_1, kendaraan_2, kendaraan_3, kendaraan_4, kendaraan_5, kendaraan_6) =tuple_kendaraan
print(kendaraan_1)


(kendaraan_1, kendaraan_2, *kendaraan_3) =tuple_kendaraan
print(kendaraan_1)
print(kendaraan_3)

mobil
mobil
['motor', 'becak', 'sepeda', 'bajai']

## Set

- datanya unik (tidak terduplikasi)
- tidak berurutan
- tidak bisa diakses elemennya

In [134]:
set_kendaraan= {'mobil','motor','motor','becak','sepeda','bajai'}
print(set_kendaraan)

{'mobil', 'motor', 'becak', 'bajai', 'sepeda'}

In [135]:
set_kendaraan= {'mobil','motor','motor','becak','sepeda','bajai'}
set_kendaraan.add('kapal')
print(set_kendaraan)

{'mobil', 'motor', 'kapal', 'becak', 'bajai', 'sepeda'}

In [136]:
set_kendaraan_1= {'mobil','motor','motor','becak','sepeda','bajai'}
set_kendaraan_2= {'mobil','bemo','kapal laut','pesawat'}
set_kendaraan_1.update(set_kendaraan_2)
print(set_kendaraan_1)

{'bemo', 'bajai', 'sepeda', 'mobil', 'motor', 'kapal laut', 'becak', 'pesawat'}

In [137]:
set_kendaraan_1= {'mobil','motor','motor','becak','sepeda','bajai'}
set_kendaraan_2= {'mobil','bemo','kapal laut','pesawat'}
set_kendaraan_1.union(set_kendaraan_2)
print(set_kendaraan_1)

{'mobil', 'motor', 'becak', 'bajai', 'sepeda'}

In [138]:
set_kendaraan_1= {'mobil','motor','motor','becak','sepeda','bajai'}
set_kendaraan_2= {'mobil','bemo','kapal laut','pesawat'}
tmp= set_kendaraan_1.union(set_kendaraan_2)
print(tmp)

{'bemo', 'bajai', 'sepeda', 'mobil', 'motor', 'kapal laut', 'becak', 'pesawat'}

In [139]:
set_kendaraan_1= {'mobil','motor','motor','becak','sepeda','bajai'}
set_kendaraan_2= {'mobil','bemo','kapal laut','pesawat'}
tmp= set_kendaraan_1.intersection(set_kendaraan_2)
print(tmp)

{'mobil'}

In [141]:
set_kendaraan_1= {'mobil','motor','motor','becak','sepeda','bajai'}
set_kendaraan_2= {'mobil','bemo','kapal laut','pesawat'}
set_kendaraan_1.intersection_update(set_kendaraan_2)
print(set_kendaraan_1)

{'mobil'}

## Dictionaries

In [146]:
dict_status= {
    'nama': 'irfan',
    'kelas': 8,
    'tinggi': 100,
    'tinggal': 'jakarta'
}

print(dict_status)
print(dict_status.items())
print(dict_status.keys())
print(dict_status.values())

{'nama': 'irfan', 'kelas': 8, 'tinggi': 100, 'tinggal': 'jakarta'}
dict_items([('nama', 'irfan'), ('kelas', 8), ('tinggi', 100), ('tinggal', 'jakarta')])
dict_keys(['nama', 'kelas', 'tinggi', 'tinggal'])
dict_values(['irfan', 8, 100, 'jakarta'])

In [147]:
dict_status= {
    'nama': 'irfan',
    'kelas': 8,
    'tinggi': 100,
    'tinggal': 'jakarta'
}

dict_status['tinggal']= 'Bandung'
print(dict_status)

{'nama': 'irfan', 'kelas': 8, 'tinggi': 100, 'tinggal': 'Bandung'}

In [148]:
dict_status= {
    'nama': 'irfan',
    'kelas': 8,
    'tinggi': 100,
    'tinggal': 'jakarta'
}

dict_status['umur']= 20
print(dict_status)

{'nama': 'irfan', 'kelas': 8, 'tinggi': 100, 'tinggal': 'jakarta', 'umur': 20}

In [149]:
dict_status= {
    'nama': 'irfan',
    'kelas': 8,
    'tinggi': 100,
    'tinggal': 'jakarta'
}

dict_status.pop('tinggal')
print(dict_status)

{'nama': 'irfan', 'kelas': 8, 'tinggi': 100}

In [151]:
dict_status= {
    'nama': 'irfan',
    'kelas': 8,
    'tinggi': 100,
    'tinggal': 'jakarta'
}

dict_status['alamat']= dict_status.pop('tinggal')
print(dict_status)

{'nama': 'irfan', 'kelas': 8, 'tinggi': 100, 'alamat': 'jakarta'}

In [153]:
child1={
    'nama':'joko',
    'umur':24
}

child2={
    'nama':'jaka',
    'umur':21
}

child3={
    'nama':'john',
    'umur':23
}

family={
    'child_1':child1,
    'child_2':child2,
    'child_3':child3
}

print(family)
print(family.items())
print(family.keys())
print(family.values())

{'child_1': {'nama': 'joko', 'umur': 24}, 'child_2': {'nama': 'jaka', 'umur': 21}, 'child_3': {'nama': 'john', 'umur': 23}}
dict_items([('child_1', {'nama': 'joko', 'umur': 24}), ('child_2', {'nama': 'jaka', 'umur': 21}), ('child_3', {'nama': 'john', 'umur': 23})])
dict_keys(['child_1', 'child_2', 'child_3'])
dict_values([{'nama': 'joko', 'umur': 24}, {'nama': 'jaka', 'umur': 21}, {'nama': 'john', 'umur': 23}])

In [156]:
child_2= family['child_2']
print(child_2['nama'])

jaka

In [155]:
print(family['child_2']['nama'])

jaka

# Conditional and Branches

In [162]:
a= 10
b= 20
c= 30

if a > b:
    print(a)
else:
    print(b,c)

20 30

In [167]:
a= 10
b= 20
c= 30

if a > b:
    print('a > b')
elif a < b:
    print('a < b')
elif a==b:
    print('a==b')
else:
    print('tidak ada')

a < b

In [198]:
# ternary operators
a= 230
b= 320
print('a==b') if a==b else print('a>b') if a>b else print('a<b')

a<b

# Looping

## While

In [169]:
i = 1
while i < 5:
    print('Perulangan ke-', i)
    i = i+1 #i+=1

Perulangan ke- 1
Perulangan ke- 2
Perulangan ke- 3
Perulangan ke- 4

In [172]:
i = 6
while i > 1:
    i = i-1 #i+=1
    print('Perulangan ke-', i)

Perulangan ke- 5
Perulangan ke- 4
Perulangan ke- 3
Perulangan ke- 2
Perulangan ke- 1

In [174]:
i = 1
while i < 6:
    print('Perulangan ke-', i)
    if i == 3:
        break
    i = i+1 #i+=1

Perulangan ke- 1
Perulangan ke- 2
Perulangan ke- 3

In [177]:
i = 5
while i > 0:
    i-=1
    if i==3:
        break
    print('Perulangan ke-', i)

Perulangan ke- 4

In [176]:
i = 5
while i > 0:
    i-=1
    if i==3:
        continue
    print('Perulangan ke-', i)

Perulangan ke- 4
Perulangan ke- 2
Perulangan ke- 1
Perulangan ke- 0

## For

In [178]:
list_kendaraan= ['mobil','motor','becak','sepeda','bajai']
for kendaraan in list_kendaraan:
    print(kendaraan)

mobil
motor
becak
sepeda
bajai

In [180]:
dict_status= {
    'nama': 'irfan',
    'kelas': 8,
    'tinggi': 100,
    'tinggal': 'jakarta'
}

for k in dict_status:
    print(dict_status[k])

irfan
8
100
jakarta

In [182]:
dict_status= {
    'nama': 'irfan',
    'kelas': 8,
    'tinggi': 100,
    'tinggal': 'jakarta'
}

for k in dict_status.keys():
    print(k)

nama
kelas
tinggi
tinggal

In [181]:
dict_status= {
    'nama': 'irfan',
    'kelas': 8,
    'tinggi': 100,
    'tinggal': 'jakarta'
}

for v in dict_status.values():
    print(v)

irfan
8
100
jakarta

In [184]:
dict_status= {
    'nama': 'irfan',
    'kelas': 8,
    'tinggi': 100,
    'tinggal': 'jakarta'
}
print(dict_status.items())
for k,v in dict_status.items():
    print(f'keys adalah {k}, values adalah {v}')

dict_items([('nama', 'irfan'), ('kelas', 8), ('tinggi', 100), ('tinggal', 'jakarta')])
keys adalah nama, values adalah irfan
keys adalah kelas, values adalah 8
keys adalah tinggi, values adalah 100
keys adalah tinggal, values adalah jakarta

In [186]:
dict_status= {
    'nama': 'irfan',
    'kelas': 8,
    'tinggi': 100,
    'tinggal': 'jakarta'
}
print(dict_status.items())
for i in dict_status.items():
    print(f'keys adalah {i[0]}, values adalah {i[1]}')

dict_items([('nama', 'irfan'), ('kelas', 8), ('tinggi', 100), ('tinggal', 'jakarta')])
keys adalah nama, values adalah irfan
keys adalah kelas, values adalah 8
keys adalah tinggi, values adalah 100
keys adalah tinggal, values adalah jakarta

# Input

In [190]:
angka= input('masukan angka')
print(angka)
print(type(angka))
print(angka*2)

30
<class 'str'>
3030

In [191]:
angka= input('masukan angka')
print(angka)
print(type(angka))
print(int(angka)*2)

30
<class 'str'>
60

In [192]:
angka= int(input('masukan angka'))
print(angka)
print(type(angka))
print(angka*2)

30
<class 'int'>
60

## Contoh Aplikasi Cek Password

In [197]:
password_benar= 'samsudin'

while True:
    password= input('masukan password anda:')
    if password == password_benar:
        print('Kata sandi anda benar, anda bisa login')
        break
    else:
        print('Kata sandi anda salah, silahkan coba lagi')

Kata sandi anda benar, anda bisa login

# Intro to Python - Part 2

## Function

In [5]:
def cetak_nama(nama=None):
    '''fungsi untuk mencetak nama'''
    print(f'Nama saya adalah {nama}')

In [6]:
cetak_nama(nama='Irfan')

Nama saya adalah Irfan

In [7]:
cetak_nama?

Signature: cetak_nama(nama=None)
Docstring: fungsi untuk mencetak nama
File:      /var/folders/2g/khfzbcm51hj5wtq1k8bww50w0000gn/T/ipykernel_740/1676882402.py
Type:      function

In [8]:
help(print)

Help on built-in function print in module builtins:

print(*args, sep=' ', end='\n', file=None, flush=False)
    Prints the values to a stream, or to sys.stdout by default.

    sep
      string inserted between values, default a space.
    end
      string appended after the last value, default a newline.
    file
      a file-like object (stream); defaults to the current sys.stdout.
    flush
      whether to forcibly flush the stream.

In [4]:
print?

Signature: print(*args, sep=' ', end='\n', file=None, flush=False)
Docstring:
Prints the values to a stream, or to sys.stdout by default.

sep
  string inserted between values, default a space.
end
  string appended after the last value, default a newline.
file
  a file-like object (stream); defaults to the current sys.stdout.
flush
  whether to forcibly flush the stream.
Type:      builtin_function_or_method

In [13]:
print('hello', 'irfan',sep='',end='')
print('hello', 'irfan',sep='')

helloirfanhelloirfan

In [14]:
def hitung_luas_persegi(sisi):
    '''fungsi untuk menghitung luas persegi'''
    luas= sisi * sisi
    print(luas)

In [16]:
hitung_luas_persegi(5)

25

In [17]:
def hitung_lk_persegi(sisi):
    '''fungsi untuk menghitung luas dan keliling persegi'''
    luas= sisi * sisi
    keliling= 4*sisi
    return luas, keliling

In [22]:
print('luas persegi:',hitung_lk_persegi(5)[0])
print('keliling persegi:',hitung_lk_persegi(5)[1])

luas persegi: 25
keliling persegi: 20

In [23]:
def hitung_luas_segitiga(alas,tinggi):
    luas= 0.5 * alas * tinggi
    return luas

In [24]:
alas= 20
tinggi= 12
luas_segitiga= hitung_luas_segitiga(alas,tinggi)
print(f'luas segitiga dengan alasnya {alas} dan tingginya {tinggi}, adalah {luas_segitiga}')

luas segitiga dengan alasnya 20 dan tingginya 12, adalah 120.0

In [28]:
def hitung_luas_segitiga(alas=20,tinggi=30):
    luas= 0.5 * alas * tinggi
    return luas

hitung_luas_segitiga(alas=10)

150.0

In [37]:
def hitung_luas_segitiga(alas,tinggi=20):
    luas= 0.5 * alas * tinggi
    return luas

hitung_luas_segitiga(10,15)

75.0

In [40]:
def hitung_luas_segitiga(alas,tinggi):
    luas= 0.5 * alas * tinggi
    return luas

In [44]:
hitung_luas_segitiga(alas=10,tinggi=15)

75.0

In [55]:
#arbitrary arguments (*args)
def profile(*nama, umur):
    print('teman saya adalah', nama)
    print('umurnya', umur)

In [56]:
profile('joni',25,25,30,umur=25)

teman saya adalah ('joni', 25, 25, 30)
umurnya 25

In [57]:
#arbitrary arguments (*args)
def profile(nama, *umur):
    print('teman saya adalah', nama)
    print('umurnya', umur)
    
profile('joni',25,25,30)

teman saya adalah joni
umurnya (25, 25, 30)

In [58]:
def profile(nama, *umur):
    print('teman saya adalah', nama)
    print('umurnya', umur[0])
    
profile('joni',25,25,30)

teman saya adalah joni
umurnya 25

In [59]:
#keyword arguments
def hitung(panjang, **lebar):
    luas_pp_1= panjang * lebar['lebar1']
    luas_pp_2= panjang * lebar['lebar2']
    return luas_pp_1, luas_pp_2
    
    
hitung(panjang= 20, lebar1= 10, lebar2=20)

(200, 400)

In [60]:
def hitung(panjang, **kwargs):
    luas_pp={}
    for key, value in kwargs.items():
       luas_pp[key] =  panjang * value
    return luas_pp


hitung(panjang= 20, lebar1= 10, lebar2=20)

{'lebar1': 200, 'lebar2': 400}

In [62]:
nama= 'johan' #variabel global
def cetak_nama():
    print('nama dia adalah', nama)
    
cetak_nama()
print(nama)

nama dia adalah johan
johan

In [64]:
nama= 'johan' #variabel global
def cetak_nama(nama='irfan'):
    #nama='jaka' #variabel  local
    print('nama dia adalah', nama)
    
cetak_nama()
print(nama)

nama dia adalah irfan
johan

In [66]:
nama= 'johan' #variabel global
def cetak_nama():
    global nama
    nama='jaka' #variabel  local
    print('nama dia adalah', nama)
    
cetak_nama()
print(nama)

nama dia adalah jaka
jaka

In [67]:
def square_sum(x,y):
    return x**2 + y**2

square_sum(3,4)

25

In [69]:
square_sum= lambda x,y: x**2 + y**2
square_sum(3,4)

25

In [72]:
#map
list_angka= [5, 10, 11, 12 , 13]
kali_dua= list(map(lambda x: x*2, list_angka))
print(kali_dua)

[10, 20, 22, 24, 26]

In [76]:
def multiplication(x):
    return x*2

list_angka= [5, 10, 11, 12 , 13]
kali_dua= list(map(multiplication,list_angka))
print(kali_dua)

[10, 20, 22, 24, 26]

## Module dan Package

In [77]:
import mod1

print(mod1.hitung_luas_segitiga(10,15))

75.0

In [78]:
print(mod2.hitung_luas_segitiga(10,15))

NameError: name 'mod2' is not defined

In [87]:
from pkg.mod1 import hitung_luas_persegi as lp

print(lp(10))
print(lp(20))
print(lp(30))

100
400
900

In [88]:
from pkg import mod1 as m
print(m.hitung_luas_persegi(10))
print(m.hitung_luas_persegi(20))
print(m.hitung_luas_persegi(30))

100
400
900

# Membaca & Menulis File

In [89]:
text= 'hello nama saya irfan'

with open('sapa.txt','w') as file:
    file.write(text)

In [91]:
with open('sapa.txt','w') as file:
    file.write('hello nama saya irfan\n')
    file.write('hello nama saya toni')

In [97]:
code='''
def hitung_luas_segitiga(alas,tinggi):
    luas= 0.5 * alas * tinggi
    return luas
'''

with open('mod3.py','w') as file:
    file.write(code)
    
    
with open('mod3.py','w') as f:
    print(code, file=f)

In [94]:
import mod3
print(mod3.hitung_luas_segitiga(10,15))

75.0

In [95]:
with open('mod3.py') as file:
    code= file.read()
    print(code)

def hitung_luas_segitiga(alas,tinggi):
    luas= 0.5 * alas * tinggi
    return luas

In [98]:
!pip install pandas

Requirement already satisfied: pandas in /Library/Frameworks/Python.framework/Versions/3.11/lib/python3.11/site-packages (2.0.2)
Requirement already satisfied: python-dateutil>=2.8.2 in /Users/irfan27/Library/Python/3.11/lib/python/site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in /Library/Frameworks/Python.framework/Versions/3.11/lib/python3.11/site-packages (from pandas) (2023.3.post1)
Requirement already satisfied: tzdata>=2022.1 in /Library/Frameworks/Python.framework/Versions/3.11/lib/python3.11/site-packages (from pandas) (2023.3)
Requirement already satisfied: numpy>=1.21.0 in /Library/Frameworks/Python.framework/Versions/3.11/lib/python3.11/site-packages (from pandas) (1.24.3)
Requirement already satisfied: six>=1.5 in /Users/irfan27/Library/Python/3.11/lib/python/site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

[notice] A new release of pip is available: 23.0 -> 24.0
[notice] To update, run: pip install --upgrade pip

In [101]:
import pandas as pd

In [105]:
df= pd.read_csv('data.csv')

In [106]:
df.head()

     nama    alamat   umur
0   irfan   jakarta     22
1   irwan   jakarta     21
2   edwan   jakarta     20
3  wildan    bekasi     20
4     edy   bandung     20

In [107]:
df.tail()

      nama    alamat   umur
9     jono   bandung     20
10   edwan   jakarta     20
11  wildan    bekasi     20
12     edy   bandung     20
13    jono   bandung     20

In [110]:
df_1= pd.read_csv('data1.csv',header=None, names=['nama','alamt','umur'])
df_1.head()

     nama     alamt  umur
0   irfan   jakarta    22
1   irwan   jakarta    21
2   edwan   jakarta    20
3  wildan    bekasi    20
4     edy   bandung    20

In [113]:
df_2= pd.read_csv('data2.csv',header=None, 
                  names=['nama','alamt','umur'],
                  sep='|')
df_2.head()

     nama     alamt  umur
0   irfan   jakarta    22
1   irwan   jakarta    21
2   edwan   jakarta    20
3  wildan    bekasi    20
4     edy   bandung    20

In [120]:
df_2= pd.read_csv('data2.csv',header=None, 
                  names=['nama','alamt','umur'],
                  sep='|',
                  skiprows=2,
                  skipfooter=2, 
                  engine='python')
df_2

     nama     alamt  umur
0   edwan   jakarta    20
1  wildan    bekasi    20
2     edy   bandung    20
3    jono   bandung    20
4   edwan   jakarta    20
5  wildan    bekasi    20
6     edy   bandung    20
7    jono   bandung    20
8   edwan   jakarta    20
9  wildan    bekasi    20

In [122]:
df_3= pd.read_csv('data3.csv')
df_3

   Unnamed: 0    nama    alamat   umur
0           0   irfan   jakarta     22
1           1   irwan   jakarta     21
2           2   edwan   jakarta     20
3           3  wildan    bekasi     20
4           4     edy   bandung     20
5           5    jono   bandung     20

In [123]:
df_3= pd.read_csv('data3.csv', index_col='Unnamed: 0')
df_3

     nama    alamat   umur
0   irfan   jakarta     22
1   irwan   jakarta     21
2   edwan   jakarta     20
3  wildan    bekasi     20
4     edy   bandung     20
5    jono   bandung     20

In [127]:
df_3= pd.read_csv('data3.csv')
df_3.drop('Unnamed: 0',axis=1, inplace=True)

In [128]:
df_3

     nama    alamat   umur
0   irfan   jakarta     22
1   irwan   jakarta     21
2   edwan   jakarta     20
3  wildan    bekasi     20
4     edy   bandung     20
5    jono   bandung     20

https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DV0101EN-SkillsNetwork/Data%20Files/Canada.xlsx

In [145]:
df_cek_canada= pd.read_excel('canada.xlsx',None)
df_cek_canada.keys()

dict_keys(['Regions by Citizenship', 'Canada by Citizenship', 'Canada by Citizenship (2)'])

In [148]:
df_excel= pd.ExcelFile('canada.xlsx')
df_excel.sheet_names

['Regions by Citizenship',
 'Canada by Citizenship',
 'Canada by Citizenship (2)']

In [150]:
df_excel.parse('Canada by Citizenship', skiprows=20, skipfooter=2)

,Type,Coverage,OdName,AREA,AreaName,REG,RegName,DEV,DevName,1980,...,2004,2005,2006,2007,2008,2009,2010,2011,2012,2013
0,Immigrants,Foreigners,Afghanistan,935,Asia,5501,Southern Asia,902,Developing regions,16,...,2978,3436,3009,2652,2111,1746,1758,2203,2635,2004
1,Immigrants,Foreigners,Albania,908,Europe,925,Southern Europe,901,Developed regions,1,...,1450,1223,856,702,560,716,561,539,620,603
2,Immigrants,Foreigners,Algeria,903,Africa,912,Northern Africa,902,Developing regions,80,...,3616,3626,4807,3623,4005,5393,4752,4325,3774,4331
3,Immigrants,Foreigners,American Samoa,909,Oceania,957,Polynesia,902,Developing regions,0,...,0,0,1,0,0,0,0,0,0,0
4,Immigrants,Foreigners,Andorra,908,Europe,925,Southern Europe,901,Developed regions,0,...,0,0,1,1,0,0,0,0,1,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
190,Immigrants,Foreigners,Viet Nam,935,Asia,920,South-Eastern Asia,902,Developing regions,1191,...,1816,1852,3153,2574,1784,2171,1942,1723,1731,2112
191,Immigrants,Foreigners,Western Sahara,903,Africa,912,Northern Africa,902,Developing regions,0,...,0,0,1,0,0,0,0,0,0,0
192,Immigrants,Foreigners,Yemen,935,Asia,922,Western Asia,902,Developing regions,1,...,124,161,140,122,133,128,211,160,174,217
193,Immigrants,Foreigners,Zambia,903,Africa,910,Eastern Africa,902,Developing regions,11,...,56,91,77,71,64,60,102,69,46,59
194,Immigrants,Foreigners,Zimbabwe,903,Africa,910,Eastern Africa,902,Developing regions,72,...,1450,615,454,663,611,508,494,434,437,407

In [137]:
df_canada= pd.read_excel('canada.xlsx',
                         sheet_name='Canada by Citizenship',
                         skiprows=20,
                         skipfooter=2,
                         )

In [140]:
df_canada.head(2)

,Type,Coverage,OdName,AREA,AreaName,REG,RegName,DEV,DevName,1980,...,2004,2005,2006,2007,2008,2009,2010,2011,2012,2013
0,Immigrants,Foreigners,Afghanistan,935,Asia,5501,Southern Asia,902,Developing regions,16,...,2978,3436,3009,2652,2111,1746,1758,2203,2635,2004
1,Immigrants,Foreigners,Albania,908,Europe,925,Southern Europe,901,Developed regions,1,...,1450,1223,856,702,560,716,561,539,620,603

## Cek tipe Data

In [152]:
df_canada.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 195 entries, 0 to 194
Data columns (total 43 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Type      195 non-null    object
 1   Coverage  195 non-null    object
 2   OdName    195 non-null    object
 3   AREA      195 non-null    int64
 4   AreaName  195 non-null    object
 5   REG       195 non-null    int64
 6   RegName   195 non-null    object
 7   DEV       195 non-null    int64
 8   DevName   195 non-null    object
 9   1980      195 non-null    int64
 10  1981      195 non-null    int64
 11  1982      195 non-null    int64
 12  1983      195 non-null    int64
 13  1984      195 non-null    int64
 14  1985      195 non-null    int64
 15  1986      195 non-null    int64
 16  1987      195 non-null    int64
 17  1988      195 non-null    int64
 18  1989      195 non-null    int64
 19  1990      195 non-null    int64
 20  1991      195 non-null    int64
 21  1992      195 non-null    int64
 22  1993      195 non-null    int64
 23  1994      195 non-null    int64
 24  1995      195 non-null    int64
 25  1996      195 non-null    int64
 26  1997      195 non-null    int64
 27  1998      195 non-null    int64
 28  1999      195 non-null    int64
 29  2000      195 non-null    int64
 30  2001      195 non-null    int64
 31  2002      195 non-null    int64
 32  2003      195 non-null    int64
 33  2004      195 non-null    int64
 34  2005      195 non-null    int64
 35  2006      195 non-null    int64
 36  2007      195 non-null    int64
 37  2008      195 non-null    int64
 38  2009      195 non-null    int64
 39  2010      195 non-null    int64
 40  2011      195 non-null    int64
 41  2012      195 non-null    int64
 42  2013      195 non-null    int64
dtypes: int64(37), object(6)
memory usage: 65.6+ KB

In [155]:
df_canada['AREA'].dtype

dtype('int64')

In [ ]:
#pengecekan data yang missing
df_canada.isnull().sum()

## Filter Data

In [157]:
df_canada.loc[:,'Type':'OdName']

           Type    Coverage          OdName
0    Immigrants  Foreigners     Afghanistan
1    Immigrants  Foreigners         Albania
2    Immigrants  Foreigners         Algeria
3    Immigrants  Foreigners  American Samoa
4    Immigrants  Foreigners         Andorra
..          ...         ...             ...
190  Immigrants  Foreigners        Viet Nam
191  Immigrants  Foreigners  Western Sahara
192  Immigrants  Foreigners           Yemen
193  Immigrants  Foreigners          Zambia
194  Immigrants  Foreigners        Zimbabwe

[195 rows x 3 columns]

In [158]:
df_canada.loc[0:4,'Type':'OdName']

         Type    Coverage          OdName
0  Immigrants  Foreigners     Afghanistan
1  Immigrants  Foreigners         Albania
2  Immigrants  Foreigners         Algeria
3  Immigrants  Foreigners  American Samoa
4  Immigrants  Foreigners         Andorra

In [160]:
df_canada.loc[0:4,['Type','OdName']]

         Type          OdName
0  Immigrants     Afghanistan
1  Immigrants         Albania
2  Immigrants         Algeria
3  Immigrants  American Samoa
4  Immigrants         Andorra

In [159]:
df_canada.iloc[0:4,0:3]

         Type    Coverage          OdName
0  Immigrants  Foreigners     Afghanistan
1  Immigrants  Foreigners         Albania
2  Immigrants  Foreigners         Algeria
3  Immigrants  Foreigners  American Samoa

In [161]:
import numpy as np

In [162]:
df_canada.iloc[1:,np.r_[0,3:6]]

           Type  AREA AreaName  REG
1    Immigrants   908   Europe  925
2    Immigrants   903   Africa  912
3    Immigrants   909  Oceania  957
4    Immigrants   908   Europe  925
5    Immigrants   903   Africa  911
..          ...   ...      ...  ...
190  Immigrants   935     Asia  920
191  Immigrants   903   Africa  912
192  Immigrants   935     Asia  922
193  Immigrants   903   Africa  910
194  Immigrants   903   Africa  910

[194 rows x 4 columns]

Untuk menggabungkan beberapa data
- merge
- concat

In [188]:
df.merge?

Signature:
df.merge(
    right: 'DataFrame | Series',
    how: 'MergeHow' = 'inner',
    on: 'IndexLabel | None' = None,
    left_on: 'IndexLabel | None' = None,
    right_on: 'IndexLabel | None' = None,
    left_index: 'bool' = False,
    right_index: 'bool' = False,
    sort: 'bool' = False,
    suffixes: 'Suffixes' = ('_x', '_y'),
    copy: 'bool | None' = None,
    indicator: 'str | bool' = False,
    validate: 'str | None' = None,
) -> 'DataFrame'
Docstring:
Merge DataFrame or named Series objects with a database-style join.

A named Series object is treated as a DataFrame with a single named column.

The join is done on columns or indexes. If joining columns on
columns, the DataFrame indexes *will be ignored*. Otherwise if joining indexes
on indexes or indexes on a column or columns, the index will be passed on.
When performing a cross merge, no column specifications to merge on are
allowed.

.. warning::

    If both key columns contain rows where the key is a null value, those
    rows will be matched against each other. This is different from usual SQL
    join behaviour and can lead to unexpected results.

Parameters
----------
right : DataFrame or named Series
    Object to merge with.
how : {'left', 'right', 'outer', 'inner', 'cross'}, default 'inner'
    Type of merge to be performed.

    * left: use only keys from left frame, similar to a SQL left outer join;
      preserve key order.
    * right: use only keys from right frame, similar to a SQL right outer join;
      preserve key order.
    * outer: use union of keys from both frames, similar to a SQL full outer
      join; sort keys lexicographically.
    * inner: use intersection of keys from both frames, similar to a SQL inner
      join; preserve the order of the left keys.
    * cross: creates the cartesian product from both frames, preserves the order
      of the left keys.

      .. versionadded:: 1.2.0

on : label or list
    Column or index level names to join on. These must be found in both
    DataFrames. If `on` is None and not merging on indexes then this defaults
    to the intersection of the columns in both DataFrames.
left_on : label or list, or array-like
    Column or index level names to join on in the left DataFrame. Can also
    be an array or list of arrays of the length of the left DataFrame.
    These arrays are treated as if they are columns.
right_on : label or list, or array-like
    Column or index level names to join on in the right DataFrame. Can also
    be an array or list of arrays of the length of the right DataFrame.
    These arrays are treated as if they are columns.
left_index : bool, default False
    Use the index from the left DataFrame as the join key(s). If it is a
    MultiIndex, the number of keys in the other DataFrame (either the index
    or a number of columns) must match the number of levels.
right_index : bool, default False
    Use the index from the right DataFrame as the join key. Same caveats as
    left_index.
sort : bool, default False
    Sort the join keys lexicographically in the result DataFrame. If False,
    the order of the join keys depends on the join type (how keyword).
suffixes : list-like, default is ("_x", "_y")
    A length-2 sequence where each element is optionally a string
    indicating the suffix to add to overlapping column names in
    `left` and `right` respectively. Pass a value of `None` instead
    of a string to indicate that the column name from `left` or
    `right` should be left as-is, with no suffix. At least one of the
    values must not be None.
copy : bool, default True
    If False, avoid copy if possible.
indicator : bool or str, default False
    If True, adds a column to the output DataFrame called "_merge" with
    information on the source of each row. The column can be given a different
    name by providing a string argument. The column will have a Categorical
    type with the value of "left_only" for observations whose merge key only
    appears in the left DataFrame, "right_only" for observations
    whose merge key only appears in the right DataFrame, and "both"
    if the observation's merge key is found in both DataFrames.

validate : str, optional
    If specified, checks if merge is of specified type.

    * "one_to_one" or "1:1": check if merge keys are unique in both
      left and right datasets.
    * "one_to_many" or "1:m": check if merge keys are unique in left
      dataset.
    * "many_to_one" or "m:1": check if merge keys are unique in right
      dataset.
    * "many_to_many" or "m:m": allowed, but does not result in checks.

Returns
-------
DataFrame
    A DataFrame of the two merged objects.

See Also
--------
merge_ordered : Merge with optional filling/interpolation.
merge_asof : Merge on nearest keys.
DataFrame.join : Similar method using indices.

Notes
-----
Support for specifying index levels as the `on`, `left_on`, and
`right_on` parameters was added in version 0.23.0
Support for merging named Series objects was added in version 0.24.0

Examples
--------
>>> df1 = pd.DataFrame({'lkey': ['foo', 'bar', 'baz', 'foo'],
...                     'value': [1, 2, 3, 5]})
>>> df2 = pd.DataFrame({'rkey': ['foo', 'bar', 'baz', 'foo'],
...                     'value': [5, 6, 7, 8]})
>>> df1
    lkey value
0   foo      1
1   bar      2
2   baz      3
3   foo      5
>>> df2
    rkey value
0   foo      5
1   bar      6
2   baz      7
3   foo      8

Merge df1 and df2 on the lkey and rkey columns. The value columns have
the default suffixes, _x and _y, appended.

>>> df1.merge(df2, left_on='lkey', right_on='rkey')
  lkey  value_x rkey  value_y
0  foo        1  foo        5
1  foo        1  foo        8
2  foo        5  foo        5
3  foo        5  foo        8
4  bar        2  bar        6
5  baz        3  baz        7

Merge DataFrames df1 and df2 with specified left and right suffixes
appended to any overlapping columns.

>>> df1.merge(df2, left_on='lkey', right_on='rkey',
...           suffixes=('_left', '_right'))
  lkey  value_left rkey  value_right
0  foo           1  foo            5
1  foo           1  foo            8
2  foo           5  foo            5
3  foo           5  foo            8
4  bar           2  bar            6
5  baz           3  baz            7

Merge DataFrames df1 and df2, but raise an exception if the DataFrames have
any overlapping columns.

>>> df1.merge(df2, left_on='lkey', right_on='rkey', suffixes=(False, False))
Traceback (most recent call last):
...
ValueError: columns overlap but no suffix specified:
    Index(['value'], dtype='object')

>>> df1 = pd.DataFrame({'a': ['foo', 'bar'], 'b': [1, 2]})
>>> df2 = pd.DataFrame({'a': ['foo', 'baz'], 'c': [3, 4]})
>>> df1
      a  b
0   foo  1
1   bar  2
>>> df2
      a  c
0   foo  3
1   baz  4

>>> df1.merge(df2, how='inner', on='a')
      a  b  c
0   foo  1  3

>>> df1.merge(df2, how='left', on='a')
      a  b  c
0   foo  1  3.0
1   bar  2  NaN

>>> df1 = pd.DataFrame({'left': ['foo', 'bar']})
>>> df2 = pd.DataFrame({'right': [7, 8]})
>>> df1
    left
0   foo
1   bar
>>> df2
    right
0   7
1   8

>>> df1.merge(df2, how='cross')
   left  right
0   foo      7
1   foo      8
2   bar      7
3   bar      8
File:      /Library/Frameworks/Python.framework/Versions/3.11/lib/python3.11/site-packages/pandas/core/frame.py
Type:      method

In [165]:
df.head(2)

    nama    alamat   umur
0  irfan   jakarta     22
1  irwan   jakarta     21

In [168]:
df.columns

Index(['nama', ' alamat', ' umur'], dtype='object')

In [170]:
df.query("` alamat` ==' jakarta'")

     nama    alamat   umur
0   irfan   jakarta     22
1   irwan   jakarta     21
2   edwan   jakarta     20
6   edwan   jakarta     20
10  edwan   jakarta     20

In [167]:
df.query("nama =='irfan'")

    nama    alamat   umur
0  irfan   jakarta     22

In [171]:
df[df['nama']=='irfan']

    nama    alamat   umur
0  irfan   jakarta     22

In [180]:
df[(df['nama']=='irfan') | (df['nama']=='irwan')]

    nama    alamat   umur
0  irfan   jakarta     22
1  irwan   jakarta     21

In [186]:
df.query("nama =='irfan' or `nama` =='irwan'")

    nama    alamat   umur
0  irfan   jakarta     22
1  irwan   jakarta     21

In [187]:
list_nama= ['irfan','irwan','edwan']
df.query("nama in @list_nama")

     nama    alamat   umur
0   irfan   jakarta     22
1   irwan   jakarta     21
2   edwan   jakarta     20
6   edwan   jakarta     20
10  edwan   jakarta     20

In [195]:
# isin 
df.query("nama.isin(@list_nama)")

df[df['nama'].isin(list_nama)]

     nama    alamat   umur
0   irfan   jakarta     22
1   irwan   jakarta     21
2   edwan   jakarta     20
6   edwan   jakarta     20
10  edwan   jakarta     20

In [183]:
df[(df['nama']=='edwan') & (df[' alamat']==' jakarta')]

     nama    alamat   umur
2   edwan   jakarta     20
6   edwan   jakarta     20
10  edwan   jakarta     20

In [175]:
print('total baris',df.shape[0])
print('total kolom',df.shape[1])

total baris 14
total kolom 3

In [189]:
df_nama= df[(df['nama']=='edwan') & (df[' alamat']==' jakarta')]

In [192]:
df_nama.to_csv('nama.csv', index=False)

In [193]:
pd.read_csv('nama.csv')

    nama    alamat   umur
0  edwan   jakarta     20
1  edwan   jakarta     20
2  edwan   jakarta     20